In [2]:
import pandas as pd
students = ['AA','BB','CC']
pd.Series(students)

0    AA
1    BB
2    CC
dtype: object

In [3]:
numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [4]:
students = ['AA','BB',None]
pd.Series(students)

0      AA
1      BB
2    None
dtype: object

In [5]:
numbers = [1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [6]:
import numpy as np
[np.nan == None, np.nan == np.nan, np.isnan(np.nan)]

[False, False, True]

In [7]:
students_scores = {'AA':'Phy','BB':'Chem','CC':'Eng'}
s = pd.Series(students_scores)
s

AA     Phy
BB    Chem
CC     Eng
dtype: object

In [8]:
s.index

Index(['AA', 'BB', 'CC'], dtype='object')

In [9]:
s = pd.Series(['Phy', 'Chem', 'Eng'], index=['AA', 'BB', 'CC'])
s

AA     Phy
BB    Chem
CC     Eng
dtype: object

In [10]:
students_scores = {'AA':'Phy','BB':'Chem','CC':'Eng'}
s = pd.Series(students_scores, index=['AA','BB','DD'])
s

AA     Phy
BB    Chem
DD     NaN
dtype: object

In [11]:
students_classes = {'AA':'Phy','BB':'Chem','CC':'Eng', 'DD':'Hist'}
s = pd.Series(students_classes)
s.iloc[3]

'Hist'

In [12]:
s.loc['BB']

'Chem'

In [13]:
s[3] # position

'Hist'

In [14]:
s['BB'] # label

'Chem'

In [15]:
class_code = {99:'Phy', 100:'Chem',101:'Eng',103:'Hist'}
s = pd.Series(class_code)
s.iloc[0] # s[0] -> error

'Phy'

In [16]:
grades = pd.Series([90,80,70,60])
total = np.sum(grades)
print(total/len(grades))

75.0

In [17]:
numbers = pd.Series(np.random.randint(0,1000,10000))
numbers.head()

0    467
1     42
2     79
3    801
4    461
dtype: int64

In [18]:
%%timeit -n 100
total = 0
for number in numbers:
    total += number
total/len(numbers)

1.81 ms ± 472 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [19]:
%%timeit -n 100
total = np.sum(numbers)
total/len(numbers)

139 µs ± 32.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [20]:
numbers += 2
numbers.head()

0    469
1     44
2     81
3    803
4    463
dtype: int64

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
for label, value in numbers.iteritems():
    s.loc[label] = value+2

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
s += 2

In [ ]:
s = pd.Series([1,2,3])
s.loc['AA'] = 102
s

In [ ]:
aa_classes = {'AA':'Phy','AA':'Chem','AA':'Eng', 'AA':'Hist'}
aa_classes = pd.Series(aa_classes)
aa_classes

In [ ]:
aa_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'AA', 'AA', 'AA'])
aa_classes

In [ ]:
students_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'BB', 'CC', 'DD'])
all_stu_class = students_classes.append(aa_classes)
all_stu_class

In [ ]:
students_classes

In [ ]:
all_stu_class.loc['AA']

In [ ]:
import pandas as pd

record1 = pd.Series({'Name':'AA', 'Class':'Phy', 'Score':85})
record2 = pd.Series({'Name':'BB', 'Class':'Chem', 'Score':82})
record3 = pd.Series({'Name':'CC', 'Class':'Bio', 'Score':98})

df = pd.DataFrame([record1,record2,record3], index=['school1','school2','school3'])
df.head()

In [1]:
import pandas as pd
students = [{'Name':'AA', 'Class':'Phy', 'Score':85},
            {'Name':'BB', 'Class':'Chem', 'Score':82},
            {'Name':'CC', 'Class':'Bio', 'Score':98}]
df = pd.DataFrame(students, index=['school1','school2','school1'])
df

        Name Class  Score
school1   AA   Phy     85
school2   BB  Chem     82
school1   CC   Bio     98

In [ ]:
df.loc['school2']

In [ ]:
type(df.loc['school2'])

In [ ]:
type(df.loc['school1'])

In [ ]:
df.loc['school1', 'Name']

In [ ]:
df.T

In [ ]:
df.T.loc['Name']

In [ ]:
df['Name']

In [ ]:
type(df['Name'])

In [ ]:
df.loc['school1']['Name']

In [ ]:
print(type(df.loc['school1']))
print(type(df.loc['school1']['Name']))

In [ ]:
df.loc[:,['Name','Score']]

In [ ]:
# drop: give new df
df.drop('school1')

In [ ]:
df

In [ ]:
copy_df = df.copy()
copy_df.drop('Name', inplace=True, axis=1)
copy_df

In [ ]:
del copy_df['Class']
copy_df

In [2]:
df['ClassRanking'] = None
df

        Name Class  Score ClassRanking
school1   AA   Phy     85         None
school2   BB  Chem     82         None
school1   CC   Bio     98         None

In [6]:
import pandas as pd

df = pd.read_csv('assets\census.csv') # windows OS
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [7]:
df = pd.read_csv('assets\census.csv', index_col = ['STNAME', 'CTYNAME']) # windows OS
df.head()

                        SUMLEV  REGION  DIVISION  STATE  COUNTY  \
STNAME  CTYNAME
Alabama Alabama             40       3         6      1       0
        Autauga County      50       3         6      1       1
        Baldwin County      50       3         6      1       3
        Barbour County      50       3         6      1       5
        Bibb County         50       3         6      1       7

                        CENSUS2010POP  ESTIMATESBASE2010  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Alabama               4779736            4780127          4785161
        Autauga County          54571              54571            54660
        Baldwin County         182265             182265           183193
        Barbour County          27457              27457            27341
        Bibb County             22915              22919            22861

                        POPESTIMATE2011  POPESTIMATE2012  ...  \
STNAME  CTYNAME                                           ...
Alabama Alabama                 4801108          4816089  ...
        Autauga County            55253            55175  ...
        Baldwin County           186659           190396  ...
        Barbour County            27226            27159  ...
        Bibb County               22733            22642  ...

                        RDOMESTICMIG2011  RDOMESTICMIG2012  RDOMESTICMIG2013  \
STNAME  CTYNAME
Alabama Alabama                 0.002295         -0.193196          0.381066
        Autauga County          7.242091         -2.915927         -3.012349
        Baldwin County         14.832960         17.647293         21.845705
        Barbour County         -4.728132         -2.500690         -7.056824
        Bibb County            -5.527043         -5.068871         -6.201001

                        RDOMESTICMIG2014  RDOMESTICMIG2015  RNETMIG2011  \
STNAME  CTYNAME
Alabama Alabama                 0.582002         -0.467369     1.030015
        Autauga County          2.265971         -2.530799     7.606016
        Baldwin County         19.243287         17.197872    15.844176
        Barbour County         -3.904217        -10.543299    -4.874741
        Bibb County            -0.177537          0.177258    -5.088389

                        RNETMIG2012  RNETMIG2013  RNETMIG2014  RNETMIG2015
STNAME  CTYNAME
Alabama Alabama            0.826644     1.383282     1.724718     0.712594
        Autauga County    -2.626146    -2.722002     2.592270    -2.187333
        Baldwin County    18.559627    22.727626    20.317142    18.293499
        Barbour County    -2.758113    -7.167664    -3.978583   -10.543299
        Bibb County       -4.363636    -5.403729     0.754533     1.107861

[5 rows x 98 columns]

In [10]:
new_df = df.rename(columns={'STATE':'Satus', 'COUNTY':'County'})
new_df.head()

                        SUMLEV  REGION  DIVISION  Satus  County  \
STNAME  CTYNAME
Alabama Alabama             40       3         6      1       0
        Autauga County      50       3         6      1       1
        Baldwin County      50       3         6      1       3
        Barbour County      50       3         6      1       5
        Bibb County         50       3         6      1       7

                        CENSUS2010POP  ESTIMATESBASE2010  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Alabama               4779736            4780127          4785161
        Autauga County          54571              54571            54660
        Baldwin County         182265             182265           183193
        Barbour County          27457              27457            27341
        Bibb County             22915              22919            22861

                        POPESTIMATE2011  POPESTIMATE2012  ...  \
STNAME  CTYNAME                                           ...
Alabama Alabama                 4801108          4816089  ...
        Autauga County            55253            55175  ...
        Baldwin County           186659           190396  ...
        Barbour County            27226            27159  ...
        Bibb County               22733            22642  ...

                        RDOMESTICMIG2011  RDOMESTICMIG2012  RDOMESTICMIG2013  \
STNAME  CTYNAME
Alabama Alabama                 0.002295         -0.193196          0.381066
        Autauga County          7.242091         -2.915927         -3.012349
        Baldwin County         14.832960         17.647293         21.845705
        Barbour County         -4.728132         -2.500690         -7.056824
        Bibb County            -5.527043         -5.068871         -6.201001

                        RDOMESTICMIG2014  RDOMESTICMIG2015  RNETMIG2011  \
STNAME  CTYNAME
Alabama Alabama                 0.582002         -0.467369     1.030015
        Autauga County          2.265971         -2.530799     7.606016
        Baldwin County         19.243287         17.197872    15.844176
        Barbour County         -3.904217        -10.543299    -4.874741
        Bibb County            -0.177537          0.177258    -5.088389

                        RNETMIG2012  RNETMIG2013  RNETMIG2014  RNETMIG2015
STNAME  CTYNAME
Alabama Alabama            0.826644     1.383282     1.724718     0.712594
        Autauga County    -2.626146    -2.722002     2.592270    -2.187333
        Baldwin County    18.559627    22.727626    20.317142    18.293499
        Barbour County    -2.758113    -7.167664    -3.978583   -10.543299
        Bibb County       -4.363636    -5.403729     0.754533     1.107861

[5 rows x 98 columns]

In [12]:
new_df.columns

Index(['SUMLEV', 'REGION', 'DIVISION', 'Satus', 'County', 'CENSUS2010POP',
       'ESTIMATESBASE2010', 'POPESTIMATE2010', 'POPESTIMATE2011',
       'POPESTIMATE2012', 'POPESTIMATE2013', 'POPESTIMATE2014',
       'POPESTIMATE2015', 'NPOPCHG_2010', 'NPOPCHG_2011', 'NPOPCHG_2012',
       'NPOPCHG_2013', 'NPOPCHG_2014', 'NPOPCHG_2015', 'BIRTHS2010',
       'BIRTHS2011', 'BIRTHS2012', 'BIRTHS2013', 'BIRTHS2014', 'BIRTHS2015',
       'DEATHS2010', 'DEATHS2011', 'DEATHS2012', 'DEATHS2013', 'DEATHS2014',
       'DEATHS2015', 'NATURALINC2010', 'NATURALINC2011', 'NATURALINC2012',
       'NATURALINC2013', 'NATURALINC2014', 'NATURALINC2015',
       'INTERNATIONALMIG2010', 'INTERNATIONALMIG2011', 'INTERNATIONALMIG2012',
       'INTERNATIONALMIG2013', 'INTERNATIONALMIG2014', 'INTERNATIONALMIG2015',
       'DOMESTICMIG2010', 'DOMESTICMIG2011', 'DOMESTICMIG2012',
       'DOMESTICMIG2013', 'DOMESTICMIG2014', 'DOMESTICMIG2015', 'NETMIG2010',
       'NETMIG2011', 'NETMIG2012', 'NETMIG2013', 'NETMIG2014', 'NETMIG2015',
       'RESIDUAL2010', 'RESIDUAL2011', 'RESIDUAL2012', 'RESIDUAL2013',
       'RESIDUAL2014', 'RESIDUAL2015', 'GQESTIMATESBASE2010',
       'GQESTIMATES2010', 'GQESTIMATES2011', 'GQESTIMATES2012',
       'GQESTIMATES2013', 'GQESTIMATES2014', 'GQESTIMATES2015', 'RBIRTH2011',
       'RBIRTH2012', 'RBIRTH2013', 'RBIRTH2014', 'RBIRTH2015', 'RDEATH2011',
       'RDEATH2012', 'RDEATH2013', 'RDEATH2014', 'RDEATH2015',
       'RNATURALINC2011', 'RNATURALINC2012', 'RNATURALINC2013',
       'RNATURALINC2014', 'RNATURALINC2015', 'RINTERNATIONALMIG2011',
       'RINTERNATIONALMIG2012', 'RINTERNATIONALMIG2013',
       'RINTERNATIONALMIG2014', 'RINTERNATIONALMIG2015', 'RDOMESTICMIG2011',
       'RDOMESTICMIG2012', 'RDOMESTICMIG2013', 'RDOMESTICMIG2014',
       'RDOMESTICMIG2015', 'RNETMIG2011', 'RNETMIG2012', 'RNETMIG2013',
       'RNETMIG2014', 'RNETMIG2015'],
      dtype='object')

In [ ]:
# mapper
new_df = df.rename(mapper = str.strip, acis='columns') # take off space

In [32]:
# replace columns title
locations = [
    {'Name':'Alice', 'Age':1, 'Gender':'F'},
    {'Name':'Jack', 'Age':5, 'Gender':'M'},
    {'Name':'Alice', 'Age':5, 'Gender':'M'}
]
df = pd.DataFrame(locations, index = ['Mathmatics', 'Sociology', 'Math'])

cols = list(df.columns)
cols = [x.lower().strip() for x in cols]
df.columns= cols
df.head()

             name  age gender
Mathmatics  Alice    1      F
Sociology    Jack    5      M
Math        Alice    5      M

In [34]:
age_mask = df['age'] > 2 # Return a bool Series
age_mask

Mathmatics    False
Sociology      True
Math           True
Name: age, dtype: bool

In [35]:
# where()  + mask
df.where(age_mask)

             name  age gender
Mathmatics    NaN  NaN    NaN
Sociology    Jack  5.0      M
Math        Alice  5.0      M

In [37]:
# dropna()
df.where(age_mask).dropna()

            name  age gender
Sociology   Jack  5.0      M
Math       Alice  5.0      M

In [13]:
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [14]:
x = obj2['California']
obj2['California'] != x

True

In [15]:
obj2['California'] == None

False

In [16]:
import math
math.isnan(obj2['California'])

True

In [17]:
obj3['California']

True

In [18]:
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [20]:
students = [{'Name':'AA', 'Class':'Phy', 'Score':85},
            {'Name':'BB', 'Class':'Chem', 'Score':82},
            {'Name':'CC', 'Class':'Bio', 'Score':98}]
df = pd.DataFrame(students, index=['school1','school2','school1'])

# df.rename(mapper = lambda x:x.upper(), axis=1)
# df

# df = df.rename(mapper = lambda x:x.upper(), axis=1)
# df

# df = df.rename(mapper = lambda x:x.upper(), axis='columns')
# df

df.rename(mapper = lambda x:x.upper(), axis=1, inplace='True')
df

        NAME CLASS  SCORE
school1   AA   Phy     85
school2   BB  Chem     82
school1   CC   Bio     98

In [21]:
df = df.rename(mapper = lambda x:x.upper(), axis=1)
df

        NAME CLASS  SCORE
school1   AA   Phy     85
school2   BB  Chem     82
school1   CC   Bio     98

In [22]:
toefl_score = [
    {'Serial No':1, 'gre score':337, 'toefl score':118},
    {'Serial No':2, 'gre score':327, 'toefl score':108},
    {'Serial No':3, 'gre score':317, 'toefl score':100},
    {'Serial No':4, 'gre score':307},
    {'Serial No':4, 'toefl score':107}
]
df = pd.DataFrame(toefl_score)
df[df['toefl score'] > 105].dropna()

   Serial No  gre score  toefl score
0          1      337.0        118.0
1          2      327.0        108.0

In [23]:
locations = [
    {'one':0, 'two':1, 'three':2},
    {'one':4, 'two':5, 'three':6},
    {'one':8, 'two':9, 'three':10}
]
df = pd.DataFrame(locations, index = ['Ohio', 'Colorado', 'Utah'])
# df.drop(['Ohio', 'Utah'])
# df.drop('Ohio')
df.drop('two', axis =1)  # df.drop('two') should claim "axis"

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10

In [24]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
# s1.loc[1]
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})
# s2.loc[1] # Error!!
# s2[1] # 2
# s2.iloc[1] # 2

In [25]:
aa_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'AA', 'AA', 'AA'])
aa_classes['AA']

AA     Phy
AA    Chem
AA     Eng
AA    Hist
dtype: object

In [26]:
toefl_score = [
    {'Serial No':1, 'gre score':337, 'toefl score':115},
    {'Serial No':2, 'gre score':327, 'toefl score':108},
    {'Serial No':3, 'gre score':317, 'toefl score':100},
    {'Serial No':4, 'gre score':307},
    {'Serial No':4, 'toefl score':105}
]
df = pd.DataFrame(toefl_score)
df[(df['toefl score'].isin(range(106,115)))]

   Serial No  gre score  toefl score
1          2      327.0        108.0

In [27]:
(df['toefl score'] > 105 ) & (df['toefl score'] < 115 ) # Will give boll Series
df[(df['toefl score'] > 105 ) & (df['toefl score'] < 115 )]

   Serial No  gre score  toefl score
1          2      327.0        108.0

In [28]:
df[(df['toefl score'].gt(105) ) & (df['toefl score'].lt(115) )]

   Serial No  gre score  toefl score
1          2      327.0        108.0

In [29]:
locations = [
    {'Name':'Alice', 'Age':1, 'Gender':'F'},
    {'Name':'Jack', 'Age':5, 'Gender':'M'},
    {'Name':'Alice', 'Age':5, 'Gender':'M'}
]
df = pd.DataFrame(locations, index = ['Mathmatics', 'Sociology', 'Math'])
df.T['Mathmatics']

Name      Alice
Age           1
Gender        F
Name: Mathmatics, dtype: object